#include <iostream>

using namespace std;

/*
    参数默认值：
        在函数不传入参数时，自动采用默认的值
    参数占位值：
        c++在声明函数时，可以设置占位参数。占位参数只
    有参数类型，而没有参数名。一般情况下，在函数体内部
    无法使用占位参数。
*/
/******************参数默认值例子*********************/
void fun(int a, int b=100)
{
    cout << "fun1: a+b = " << a+b << endl;
}



/******************参数占位值例子*********************/
void fun1(int a, int b, int)
{
    cout << "fun1: a+b = " << a+b << endl;
}

void fun2(int a, int b, int=20)
{
    cout << "fun2: a+b = " << a+b << endl;
}

int main(int argc, char *argv[]) 
{    
    /******************参数默认值例子*********************/
    fun(10);
    fun(10, 20);


    /******************参数占位值例子*********************/
    // fun1(10,20);   //报错，占位参数也是参数，必须传参数
    fun1(10,20,100);

    fun2(40,50);
    fun2(40,50,60);

    return 0;
}